trade_exp/src/DataProcessors/ЗагрузкаТоваровИзВнешнихФайлов/ЗагрузкаТоваровИзВнешнихФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be362f21-420b-4b26-aa8a-c81cb604988a">
  <name>ЗагрузкаТоваровИзВнешнихФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ed96c3e-4885-4c35-b010-4d22e1d10826">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb652c53-8b80-4555-a9eb-dba4d24c612d">
  <name>НоменклатураКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="35dcedc2-6c02-4494-a957-999efc7f1ae7">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b9e71aa-206f-494a-be92-2099bc584304">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e355be6-f29f-46ba-a67b-b41db62687e6">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2c26441-ecdb-4656-bfd2-15f5621bd867">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ba1c2c1-f2b5-4b91-81cd-71906bc59b5a">
    <name>СсылкаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e389a121-b8cf-4d11-880c-d1a91f8a65c6">
    <name>ИдентификаторХарактеристикиСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6c2e5f0-1d5b-4909-b1f4-190730a95807">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08da99ab-bdc3-4fbb-b68e-98ba498e8814">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="76b8b4ff-dbbb-41af-b9d3-eece0efd384e">
    <name>НаименованиеХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="886b5382-1411-426f-bae0-51a8d59061d3">
    <name>НаименованиеНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="68ea9c88-8801-4703-ac3e-ff587347cf04">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a5af94d-ca5b-4cb0-be5e-029447ca2a71">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34a1357c-8d63-4c12-b663-e88abd1d7df4">
    <name>ИдентификаторУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bca5b07c-01c8-4c0b-9ed7-4810c51d3910">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1dba536a-b803-434b-94a3-80de0cfbde3d">
    <name>КоличествоБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a38082a7-b8ce-49cf-85e3-056c1cd803fc">
    <name>КодОКЕИБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="891c08dd-bcea-4e09-809d-8e830642d676">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e18d6d8-c79f-42e1-95f0-16d93af84adb">
    <name>ИдентификаторНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6130cd0e-f870-4377-baac-01dd976a0c5d">
    <name>ИдентификаторХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="813f8473-3a44-42ee-a3d0-207a403b522c">
    <name>ИдентификаторНоменклатурыСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a5f5f8-7089-4e4c-af50-898ec05999a2">
    <name>КратностьПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6df5f190-8dbb-42e5-9d6a-fe9c6a02f8c7">
    <name>КратностьНаша</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0838c53d-d8ea-408d-9855-9df21318eea1">
    <name>КоэффициентКратности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4978b9b-01f1-4377-bc57-fba19aff59b7">
    <name>ЕдиницаПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="47d77738-1948-484f-ac39-88caf37b918b">
    <name>ДругиеШтрихкодыНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d217e494-52d2-47db-bda3-c73ad5bd093e">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ЗагрузкаТоваровИзВнешнихФайлов/Forms/ФормаЗаявкиКлиентов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
    Объект.Партнер = Параметры.Партнер;
    Склад=Параметры.Склад;
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаТоваровИзВнешнихФайлов.ПолучитьМакет("МакетЗаявкиКлиентов");
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Очистить();  
	
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаявку(Команда)
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C3").Текст);
	
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	если СопоставленыДанныеТабличногоДокументаСДаннымиИБ()	 тогда 
		ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
	иначе
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
	конецесли;	
	
КонецПроцедуры

&НаСервере
Функция СопоставленыДанныеТабличногоДокументаСДаннымиИБ()
	
	ТоварыДляЗаявки.Очистить(); 
	ТоварыНеСопоставленные.Очистить();
	НомерСтроки = 2 ;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураАртикул=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
	или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);
	Пока ЗаполненыНоменклатураАртикул Цикл     
		Артикул=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст;  
		НоменклатураПартнера=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст;  
		НоменклатураПартнераСсылка="";
		если значениезаполнено(Артикул) тогда
			НоменклатураПартнераСсылка=Справочники.НоменклатураКонтрагентов.НайтиПоРеквизиту("Артикул",Артикул,,Объект.Партнер);
		иначеесли значениезаполнено(НоменклатураПартнера) тогда
			НоменклатураПартнераСсылка=Справочники.НоменклатураКонтрагентов.НайтиПоНаименованию(НоменклатураПартнера,истина,,Объект.Партнер);
		конецесли;
		Количество=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C3").Текст;
		если значениезаполнено(НоменклатураПартнераСсылка) тогда  
			Стр=ТоварыДляЗаявки.Добавить();
			Стр.НоменклатураПартнера=НоменклатураПартнераСсылка;
			Стр.Номенклатура=НоменклатураПартнераСсылка.Номенклатура;
			стр.Количество=ПривестиКЧислу(Количество);
		иначе
			стр=ТоварыНеСопоставленные.Добавить();
			стр.Артикул=Артикул;
			стр.НоменклатураСтрока=НоменклатураПартнера; 
			стр.Количество=ПривестиКЧислу(Количество);
		конецесли;	
		НомерСтроки = НомерСтроки+1 ;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		ЗаполненыНоменклатураАртикул=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
		или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);

	конеццикла;	                                   
	
	возврат  ТоварыНеСопоставленные.Количество()=0;
	
КонецФункции               

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиКЧислу(ЗначениеДляПриведения)
	мТипов = Новый Массив;
	мТипов.Добавить(Тип("Число"));
	мТипов.Добавить(Тип("ОписаниеТипов"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(мТипов);
	ПриведенноеЗначение = ОписаниеТиповЧ.ПривестиЗначение(ЗначениеДляПриведения);
	
	Возврат ПриведенноеЗначение;
КонецФункции // ПривестиКЧислу()


&НаКлиентеНаСервереБезКонтекста
Функция ПрисвоитьЧисловоеЗначение(Приемник, СтрокаИсточникЧисловогоЗначения, АбсолютныйНомерСтроки, НазваниеКолонки, ВысотаШапки = 0)
	Успех = Истина;
	
	ЗначениеДляПриведения = СтрЗаменить(СтрокаИсточникЧисловогоЗначения, " ", "");
	Если ЗначениеЗаполнено(ЗначениеДляПриведения) Тогда
		мТипов = Новый Массив;
		мТипов.Добавить(Тип("Число"));
		мТипов.Добавить(Тип("ОписаниеТипов"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(мТипов);
		ПриведенноеЗначение = ОписаниеТиповЧ.ПривестиЗначение(ЗначениеДляПриведения);
		Если Не ПриведенноеЗначение = Неопределено Тогда
			Приемник = ПриведенноеЗначение;			
		Иначе
			Успех = Ложь;
			ТекстОшибки = НСтр("ru='В строке %НомерСтроки%, колонке ""%Колонка%"" введено значение ""%Значение%"", не являющееся числом.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", АбсолютныйНомерСтроки-ВысотаШапки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Колонка%", НазваниеКолонки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Значение%", СтрокаИсточникЧисловогоЗначения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	Иначе
		Приемник = 0;
	КонецЕсли;
	
	Возврат Успех;
КонецФункции

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ДобавитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере()
	ошибокнет=истина;         
	УстановитьПривилегированныйРежим(истина);
	для каждого стр из ТоварыНеСопоставленные цикл
		если значениезаполнено(стр.Номенклатура) и не значениезаполнено(стр.НоменклатураПартнера) тогда
			попытка      
				Спр=Справочники.НоменклатураКонтрагентов.СоздатьЭлемент(); 
				Спр.Владелец=Объект.Партнер;
				Спр.Артикул=стр.Артикул;
				Спр.Наименование=стр.НоменклатураСтрока;  
				Спр.НаименованиеНоменклатуры=стр.НоменклатураСтрока;  
				спр.Номенклатура=стр.Номенклатура;
				//спр.ОбменДанными.Загрузка=истина;
				Спр.Записать();
				стр.НоменклатураПартнера=Спр.ссылка;
			исключение	
				ошибокнет=Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
					?(Спр.ДополнительныеСвойства.Свойство("ОбнаруженоДублированиеКлючевыхЗначений"), Спр.ДополнительныеСвойства.ОбнаруженоДублированиеКлючевыхЗначений, Неопределено));
			конецпопытки;	
		конецесли;
	конеццикла;	         
	УстановитьПривилегированныйРежим(ложь);
	если ошибокнет тогда    
		//для Индекс=0 по ТоварыНеСопоставленные.Количество() цикл 
		//	если  ТоварыНеСопоставленные.Количество()=0 тогда
		//		прервать;
		//	конецесли;	
		//	если значениезаполнено(стр.Номенклатура) тогда
		//		СтрТовары=ТоварыДляЗаявки.Добавить();
		//		заполнитьзначениясвойств(стрТовары,стр);  
		//		ТоварыНеСопоставленные.Удалить(Индекс);
		//		Индекс=Индекс-1;
		//	конецесли;	
		//конеццикла;	   
		
		ВсегоСтрок=ТоварыНеСопоставленные.Количество();        
		сч=1;        
		пока сч<=ВсегоСтрок цикл        
			стр=ТоварыНеСопоставленные.Получить(сч-1);
			если значениезаполнено(стр.Номенклатура) тогда
				СтрТовары=ТоварыДляЗаявки.Добавить();
				заполнитьзначениясвойств(стрТовары,стр);  
				ТоварыНеСопоставленные.Удалить(сч-1);
				ВсегоСтрок = ВсегоСтрок -1;
			Иначе
				сч=сч+1;
			КонецЕсли;    
		Конеццикла;
		ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
	конецесли;	
КонецПроцедуры   

Процедура ОбработатьТаблицуЗаявок()

	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.НоменклатураПартнера КАК НоменклатураПартнера,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ ВР_таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_таблица.Номенклатура КАК Номенклатура,
		|	ВР_таблица.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ВР_таблица.Количество КАК Количество,
		|	ВР_таблица.Количество КАК КоличествоУпаковок,
		|	ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток КАК ДоступныйОстаток,
		|	ВЫБОР
		|		КОГДА ВР_таблица.Количество > ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)
		|			ТОГДА ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) - ВР_таблица.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК нехватка,
		|	ВР_таблица.Количество > ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) КАК Нехватает
		|ИЗ
		|	ВР_таблица КАК ВР_таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
		|				,
		|				Склад = &Склад
		|					И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ЗапасыИПотребностиОстатки
		|		ПО ВР_таблица.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура";
			
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Таблица", ТоварыДляЗаявки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТоварыДляЗаявки.Загрузить(РезультатЗапроса.Выгрузить());


КонецПроцедуры


&НаКлиенте
Процедура ПропуститьНоменклатуру(Команда)       
	    ОбработатьТаблицуЗаявок();
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг3;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)        
	если Элементы.Шаги.ТекущаяСтраница.Имя="Шаг3" тогда 
		если ТоварыНеСопоставленные.Количество()>0 Тогда
			Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;  
		иначе      
			Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;  
		конецесли;
	иначеесли Элементы.Шаги.ТекущаяСтраница.Имя="Шаг2" тогда
		Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;  
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
		АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		Закрыть(АдресТоваровВХранилище);
КонецПроцедуры

&НаСервере
Функция ТаблицаСВариантамиОбеспечения()
	ТаблицаРезультата=ТоварыДляЗаявки.Выгрузить();
	ТаблицаРезультата.Очистить();
	для каждого стр из ТоварыДляЗаявки цикл  

		стр.Склад = Склад; 
		стр.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.СоСклада;
		если стр.ДоступныйОстаток=0 тогда
			стр.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется; 
		иначеесли стр.Количество>стр.ДоступныйОстаток Тогда
			Нехватка=стр.Количество-стр.ДоступныйОстаток;
			стр.Количество=стр.ДоступныйОстаток;
			стр.КоличествоУпаковок=стр.ДоступныйОстаток;
			ДобавленнаяСтрока=ТаблицаРезультата.Добавить();
			заполнитьЗначенияСвойств(ДобавленнаяСтрока,стр); 
			ДобавленнаяСтрока.Количество=Нехватка;
			ДобавленнаяСтрока.КоличествоУпаковок=Нехватка;
			ДобавленнаяСтрока.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется;  
		конецесли;      
		ДобавленнаяСтрока=ТаблицаРезультата.Добавить();
		заполнитьЗначенияСвойств(ДобавленнаяСтрока,стр);		
	конеццикла;	
   Возврат ТаблицаРезультата;
КонецФункции


&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаСВариантамиОбеспечения());
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	  Закрыть();
КонецПроцедуры
